---
title: LinkConversionData
classe: Autodesk.Revit.DB.LinkConversionData
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# LinkConversionData

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `linkConversionData.IsValidObject` | Boolean |
| `String Path { get; }` | `linkConversionData.Path` | String |
| `Guid ServerId { get; }` | `linkConversionData.ServerId` | Guid |
| `Void Dispose()` | `linkConversionData.Dispose()` | Void |
| `IDictionary<String, String> GetOptions()` | `linkConversionData.GetOptions()` | IDictionary<String, String> |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```